read_verilog labyrinth.v
hierarchy; proc; opt; techmap; opt
show -format svg -stretch
write_verilog synth.v
